Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_carer_s_leave_and_annual_leave.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Carer's leave and annual leave
ga: Cás- Staidéar ar shaoire cúramóra agus saoire bhliantúil

source: Tom took carer's leave from work to look after his father who was seriously ill
ga: Thóg Tom saoire cúramóra ón obair chun aire a thabhairt dá athair a bhí go dona breoite

source: He took 78 weeks which was most of his entitlement
ga: Thóg sé formhór a theidlíocht de 78 seachtaine

source: On his return to work, he was discussing annual leave with his employer
ga: Ar fhilleadh chun na hoibre dó, bhí sé ag plé saoire bliantúil lena fhostóir

source: His employer said that, as he understood it, employees cannot take annual leave in the same calendar year the carer's leave ends. Is this correct or not?
ga: Dúirt a fhostóir, mar a thuig sé féin, nach féidir le fostaithe saoire bhliantúil a thógáil sa bhliain fhéilire céanna ina gcríochnaíonn saoire cúramóra

source: Tom's employer is incorrect
ga: Tá fostóir Tom mícheart

source: Provided Tom has accumulated sufficient hours of work, he is entitled to take annual leave, even if this occurs in the same calendar year as his carer's leave ends
ga: Chomh fada agus go bhfuil dóthain uaireanta oibre carnaithe ag Tom, tá sé i dteideal saoire bliantúil a thógáil, fiú amháin má tharlaíonn sé seo sa bhliain fhéilire céanna ina gcríochnaíonn a shaoire cúramóra

source: Only the first 13 weeks however of the period spent on carer's leave count towards establishing entitlement to annual leave
ga: An chéad 13 seachtaine amháin cibé ar bith a áirítear i dtreo theidlíocht do shaoire bhliantúil a bhunú

source: In the same way, Tom only has rights in respect of public holidays falling in the first 13 weeks of his carer's leave
ga: Ar an mbealach céanna, níl cearta ag Tom ach amháin maidir le saoire phoiblí a thiteann sa chéad 13 seachtaine dá shaoire cúramóra

source: The maximum period of carer's leave is 104 weeks
ga: Is an tuastréimhse do shaoire cúramóra 104 seachtaine

source: If Tom's father becomes ill again, Tom can apply for the balance of his carer's leave
ga: Má éiríonn athair Tom breoite arís, is féidir le Tom iarratas a dhéanamh ar an bhfuílleach dá shaoire cúramóra

source: He is entitled to a maximum of 26 weeks provided there is a gap of at least 6 weeks between the two periods of carer's leave
ga: Tá sé i dteideal d'uasmhéid de 26 seachtaine chomh fada agus go bhfuil bearna atá ar laghad 6 seachtaine idir an dá thréimhse shaoire cúramóra
